Revit 2027 API
StairsPathType.StartFromRiser Property
 True if the stairs path starts from the riser, false if it starts from the tread.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool StartFromRiser { get; set; }
Public Property StartFromRiser As Boolean
	Get
	Set
public:
property bool StartFromRiser {
	bool get ();
	void set (bool value);
}
member StartFromRiser : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The StairsPathType is not fixed up direction so the data being set is not applicable.
See Also
Reference
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace